Documents/СписаниеСИЗИзЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеСИЗИзЭксплуатации</Name>
			<BasedOn>
				<xr:Item>Document.ВыдачаСИЗ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыданныеСИЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВыдачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВыдачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующейВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследняяВыдача</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РолиЧленовКомиссииОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РолиЧленовКомиссииОхраныТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительПредседателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СписаниеСИЗИзЭксплуатации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОхранаТрудаКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Списание СИЗ'"));
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.СписаниеСИЗИзЭксплуатации);
	Если КомандаСоздатьНаОсновании <> Неопределено Тогда
		КомандаСоздатьНаОсновании.Обработчик = "СредстваИндивидуальнойЗащитыКлиент.ВвестиСписаниеСИЗИзЭксплуатации";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	КонецЕсли;
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, , "ОхранаТруда");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.СписаниеСИЗИзЭксплуатации;
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	ОхранаТруда.НеВключатьЧленовКомиссииВКраткийСоставДокумента(МетаданныеДокумента.ТабличныеЧасти.Комиссия.Имя, ОписаниеСостава);
	
	Возврат ОписаниеСостава;
	
КонецФункции

Процедура ЗаполнитьСоставКомиссии(Комиссия, Организация, Подразделение) Экспорт 
	ОхранаТруда.ЗаполнитьСоставКомиссии(Комиссия, Организация, Подразделение, "СписаниеСИЗИзЭксплуатации");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.СписаниеСИЗИзЭксплуатации";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОСписанииСИЗ";
	КомандаПечати.Представление = НСтр("ru = 'Акт о списании СИЗ'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.СписаниеСИЗИзЭксплуатации";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПриказОСозданииКомиссии";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о создании комиссии'");
	КомандаПечати.Порядок = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОСписанииСИЗ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_АктОСписанииСИЗ",
			НСтр("ru = 'Акт о списании СИЗ'"), ПечатьАктаСписанияСИЗ(МассивОбъектов, ОбъектыПечати), ,
			"Документ.СписаниеСИЗИзЭксплуатации.ПФ_MXL_АктОСписанииСИЗ");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОСозданииКомиссии") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПриказОСозданииКомиссии",
			НСтр("ru = 'Приказ о создании комиссии'"), ПечатьПриказаОСозданииКомиссии(МассивОбъектов, ОбъектыПечати), ,
			"Документ.СписаниеСИЗИзЭксплуатации.ПФ_MXL_ПриказОСозданииКомиссии");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьАктаСписанияСИЗ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеСИЗИзЭксплуатации_АктОСписанииСИЗ";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеСИЗИзЭксплуатации.ПФ_MXL_АктОСписанииСИЗ");
	
	ДанныеДляПечати = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ДанныеДляПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ОписаниеДокумента = ДанныеПечати.Значение;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Формируем печатную форму продления.
		Результат = Новый ТабличныйДокумент;
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ОписаниеДокумента);
		ОбластьШапка.Параметры.Город = ?(ПустаяСтрока(ОписаниеДокумента.Город), "____________", ОписаниеДокумента.Город);
		
		ЧленыКомиссии = "";
		Для каждого ДанныеЧленаКомиссии Из ОписаниеДокумента.ЧленыКомиссии Цикл
			Если ПустаяСтрока(ЧленыКомиссии) Тогда
				ЧленыКомиссии = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 - %2'"),
					Строка(ДанныеЧленаКомиссии.ЧленКомиссии), Строка(ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии));
			Иначе
				ЧленыКомиссии = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2 - %3'"),
					ЧленыКомиссии, Строка(ДанныеЧленаКомиссии.ЧленКомиссии), Строка(ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии));
			КонецЕсли;
		КонецЦикла;
		ОбластьШапка.Параметры.ЧленыКомиссии = ЧленыКомиссии;
		Результат.Вывести(ОбластьШапка);
		
		Если ЗначениеЗаполнено(ОписаниеДокумента.ПодразделениеПредставление) Тогда
			ОбластьПодразделение = Макет.ПолучитьОбласть("Подразделение");
			ОбластьПодразделение.Параметры.Подразделение = ОписаниеДокумента.ПодразделениеПредставление;
			Результат.Вывести(ОбластьПодразделение);
		КонецЕсли;
		
		Результат.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
		
		ТаблицаСИЗ = ОписаниеДокумента.ТаблицаСИЗ;
		СотрудникСИЗ = Неопределено;
		Для Каждого СтрокаСИЗ Из ТаблицаСИЗ Цикл
			Если СтрокаСИЗ.ФизическоеЛицо <> СотрудникСИЗ Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаОбъединенная");
			КонецЕсли;
			СотрудникСИЗ = СтрокаСИЗ.ФизическоеЛицо;
			ОбластьСтрока.Параметры.Заполнить(ОписаниеДокумента);
			ОбластьСтрока.Параметры.Заполнить(СтрокаСИЗ);
			Результат.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьПодвал);
		
		ОбластьПодвалСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");
		Для каждого ДанныеЧленаКомиссии Из ОписаниеДокумента.ЧленыКомиссии Цикл
			ОбластьПодвалСтрока.Параметры.ФИОЧленКомиссии = ДанныеЧленаКомиссии.ФИОЧленКомиссии;
			ОбластьПодвалСтрока.Параметры.Должность = ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии;
			Результат.Вывести(ОбластьПодвалСтрока);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(Результат);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОписаниеДокумента.ДокументСсылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПриказаОСозданииКомиссии(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеСИЗИзЭксплуатации_ПриказОСозданииКомиссии";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеСИЗИзЭксплуатации.ПФ_MXL_ПриказОСозданииКомиссии");
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ДанныеДокумента);
		ОбластьШапка.Параметры.Город = ?(ПустаяСтрока(ДанныеДокумента.Город), "____________", ДанныеДокумента.Город);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьПредседатель = Макет.ПолучитьОбласть("Председатель");
		ОбластьПредседатель.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьПредседатель);
		
		ОбластьПервыйЧленКомиссии = Макет.ПолучитьОбласть("ПервыйЧленКомиссии");
		ОбластьЧленыКомиссии = Макет.ПолучитьОбласть("ЧленыКомиссии");
		ПервыйЧленКомиссии = Истина;
		Для каждого ДанныеЧленаКомиссии Из ДанныеДокумента.ЧленыКомиссии Цикл
			Если ПервыйЧленКомиссии Тогда
				ПервыйЧленКомиссии = Ложь;
				ОбластьПервыйЧленКомиссии.Параметры.ЧленКомиссии = ДанныеЧленаКомиссии.ЧленКомиссии;
				ОбластьПервыйЧленКомиссии.Параметры.Должность = ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии;
				ТабличныйДокумент.Вывести(ОбластьПервыйЧленКомиссии);
			Иначе
				ОбластьЧленыКомиссии.Параметры.ЧленКомиссии = ДанныеЧленаКомиссии.ЧленКомиссии;
				ОбластьЧленыКомиссии.Параметры.Должность = ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии;
				ТабличныйДокумент.Вывести(ОбластьЧленыКомиссии);
			КонецЕсли;
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ОбластьПодвалСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");
		Для каждого ДанныеЧленаКомиссии Из ДанныеДокумента.ЧленыКомиссии Цикл
			ОбластьПодвалСтрока.Параметры.ФИОЧленКомиссии = ДанныеЧленаКомиссии.ФИОЧленКомиссии;
			ОбластьПодвалСтрока.Параметры.Должность = ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии;
			ТабличныйДокумент.Вывести(ОбластьПодвалСтрока);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСИЗИзЭксплуатации.Ссылка КАК ДокументСсылка,
		|	СписаниеСИЗИзЭксплуатацииКомиссия.ЧленКомиссии КАК ЧленКомиссии,
		|	СписаниеСИЗИзЭксплуатацииКомиссия.Должность КАК ДолжностьЧленаКомиссии,
		|	СписаниеСИЗИзЭксплуатацииКомиссия.РольВКомиссии КАК РольВКомиссии
		|ИЗ
		|	Документ.СписаниеСИЗИзЭксплуатации КАК СписаниеСИЗИзЭксплуатации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСИЗИзЭксплуатации.Комиссия КАК СписаниеСИЗИзЭксплуатацииКомиссия
		|		ПО СписаниеСИЗИзЭксплуатации.Ссылка = СписаниеСИЗИзЭксплуатацииКомиссия.Ссылка
		|ГДЕ
		|	СписаниеСИЗИзЭксплуатации.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Списание.Ссылка КАК ДокументСсылка,
		|	Списание.Номер КАК Номер,
		|	Списание.Дата КАК Дата,
		|	Списание.ДатаПриказа КАК ДатаПриказа,
		|	Списание.НомерПриказа КАК НомерПриказа,
		|	Списание.Организация КАК Организация,
		|	Списание.Подразделение КАК Подразделение,
		|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	Списание.Руководитель КАК Руководитель,
		|	Списание.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	Списание.Ответственный КАК Ответственный,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					Документ.СписаниеСИЗИзЭксплуатации.НоменклатураСИЗ КАК ПереченьСИЗ
		|				ГДЕ
		|					ПереченьСИЗ.Ссылка = Списание.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСИЗ
		|ИЗ
		|	Документ.СписаниеСИЗИзЭксплуатации КАК Списание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО Списание.Организация = Организации.Ссылка
		|ГДЕ
		|	Списание.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписаниеРабочиеМеста.Ссылка КАК ДокументСсылка,
		|	СписаниеРабочиеМеста.РабочееМесто КАК РабочееМесто,
		|	СписаниеРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СписаниеСИЗИзЭксплуатации.СИЗ КАК СИЗ,
		|	СписаниеСИЗИзЭксплуатации.Номенклатура КАК Номенклатура,
		|	СписаниеСИЗИзЭксплуатации.Номенклатура.Артикул КАК НоменклатурныйНомер,
		|	СписаниеСИЗИзЭксплуатации.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СписаниеСИЗИзЭксплуатации.Количество КАК Количество,
		|	СписаниеСИЗИзЭксплуатации.НомерСтроки КАК НомерСтрокиСИЗ,
		|	СписаниеРабочиеМеста.НомерСтроки КАК НомерСтроки,
		|	СписаниеСИЗИзЭксплуатации.ПоследняяВыдача КАК ПоследняяВыдача,
		|	СписаниеСИЗИзЭксплуатации.СпособВыдачи КАК СпособВыдачи,
		|	СписаниеСИЗИзЭксплуатации.КратностьВыдачи КАК КратностьВыдачи,
		|	СписаниеСИЗИзЭксплуатации.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	СписаниеСИЗИзЭксплуатации.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СписаниеСИЗИзЭксплуатации.ПричинаСписания КАК ПричинаСписания
		|ИЗ
		|	Документ.СписаниеСИЗИзЭксплуатации.РабочиеМеста КАК СписаниеРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеСИЗИзЭксплуатации.НоменклатураСИЗ КАК СписаниеСИЗИзЭксплуатации
		|		ПО (СписаниеРабочиеМеста.Ссылка В (&МассивОбъектов))
		|			И СписаниеРабочиеМеста.Ссылка = СписаниеСИЗИзЭксплуатации.Ссылка
		|			И СписаниеРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = СписаниеСИЗИзЭксплуатации.ИдентификаторСтрокиРабочегоМеста
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерСтроки,
		|	НомерСтрокиСИЗ";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	МаксимальныйИндекс = РезультатыЗапроса.ВГраница();
	
	ВыборкаСИЗ = РезультатыЗапроса[МаксимальныйИндекс].Выбрать();
	ВыборкаДокументов = РезультатыЗапроса[МаксимальныйИндекс - 1].Выбрать();
	ВыборкаКомиссия = РезультатыЗапроса[МаксимальныйИндекс - 2].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		Описание = ОписаниеДляПечати();
		ЗаполнитьОписаниеСИЗ(Описание, ВыборкаДокументов, ВыборкаСИЗ);
		ЗаполнитьОписаниеЧленамиКомиссии(Описание, ВыборкаДокументов, ВыборкаКомиссия);
		
		// Заполнение соответствия
		ДанныеПечатиОбъектов.Вставить(ВыборкаДокументов.ДокументСсылка, Описание);
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

Функция ОписаниеДляПечати()
	
	Описание = Новый Структура;
	Описание.Вставить("ДокументСсылка");
	Описание.Вставить("Дата");
	Описание.Вставить("Номер");
	Описание.Вставить("ДатаПриказа");
	Описание.Вставить("НомерПриказа");
	Описание.Вставить("ОрганизацияНаименованиеПолное");
	Описание.Вставить("ПодразделениеПредставление");
	Описание.Вставить("ФИОРуководителя");
	Описание.Вставить("ПолРуководителя");
	Описание.Вставить("ФамилияРуководителя");
	Описание.Вставить("ТаблицаСИЗ");
	Описание.Вставить("Ответственный");
	
	ТаблицаСИЗ = Новый ТаблицаЗначений;
	ТаблицаСИЗ.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.СписаниеСИЗИзЭксплуатации"));
	ТаблицаСИЗ.Колонки.Добавить("НомерСтрокиСИЗ", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаСИЗ.Колонки.Добавить("СИЗ", Новый ОписаниеТипов("СправочникСсылка.СредстваИндивидуальнойЗащиты"));
	ТаблицаСИЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСИЗ.Колонки.Добавить("НоменклатурныйНомер", Новый ОписаниеТипов("Строка"));
	ТаблицаСИЗ.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаСИЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("НормаЭксплуатации", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ВремяЭксплуатации", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ПричинаСписания", Новый ОписаниеТипов("Строка"));
	
	Описание.ТаблицаСИЗ = ТаблицаСИЗ;
	
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписаниеСИЗ(Описание, ВыборкаДокументов, ВыборкаСИЗ)
	
	ЗаполнитьЗначенияСвойств(Описание, ВыборкаДокументов);
	
	Описание.Дата = Формат(ВыборкаДокументов.Дата, "ДЛФ=D");
	Описание.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер);
	Описание.ДатаПриказа = Формат(ВыборкаДокументов.ДатаПриказа, "ДЛФ=ДД");
	Если Не ЗначениеЗаполнено(Описание.НомерПриказа) Тогда
		Описание.НомерПриказа = Описание.Номер;
	КонецЕсли;
	
	Описание.ПодразделениеПредставление = Строка(ВыборкаДокументов.Подразделение);
	
	Если ВыборкаДокументов.ЕстьСИЗ Тогда
		Пока ВыборкаСИЗ.НайтиСледующий(ВыборкаДокументов.ДокументСсылка, "ДокументСсылка") Цикл
			НоваяСтрока = Описание.ТаблицаСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСИЗ);
			
			Если ВыборкаСИЗ.КратностьВыдачи = 0 Или ВыборкаСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
				НоваяСтрока.НормаЭксплуатации = НСтр("ru = 'До износа'");
			Иначе
				НоваяСтрока.НормаЭксплуатации = СредстваИндивидуальнойЗащиты.ИнтервалМесяцев(
					ВыборкаСИЗ.ЕдиницаПериодичностиВыдачи, ВыборкаСИЗ.ПериодичностьВыдачи, ВыборкаСИЗ.КратностьВыдачи);
			КонецЕсли;
			
			НоваяСтрока.ВремяЭксплуатации = ЗарплатаКадрыРасширенныйКлиентСервер.РазницаВМесяцах(
				ВыборкаСИЗ.ПоследняяВыдача, ВыборкаДокументов.Дата);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеЧленамиКомиссии(Описание, ВыборкаДокументов, ВыборкаКомиссия)
	
	// ФИОРуководителя
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина, ВыборкаДокументов.Руководитель, "ФамилияИО, Пол, Фамилия", ОбщегоНазначения.ТекущаяДатаПользователя());
	Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
		Описание.ФИОРуководителя = СтрокаКадровыхДанных.ФамилияИО;
		Описание.ПолРуководителя = СтрокаКадровыхДанных.Пол;
		Описание.ФамилияРуководителя = СтрокаКадровыхДанных.Фамилия;
	КонецЦикла;
	
	// Сведения об организации
	ИменаПолей =
	"ОргСубъект,
	|ОргНПункт,
	|ОргГород";
	
	УстановитьПривилегированныйРежим(Истина);
	СведенияОбОрганизации = ЗарплатаКадры.СведенияОбОрганизации(ВыборкаДокументов.Организация, ИменаПолей);
	УстановитьПривилегированныйРежим(Ложь);
	
	Описание.Вставить("Город", ОхранаТруда.ГородИзСведенийОбОрганизации(СведенияОбОрганизации));
	
	МассивЧленовКомиссии = Новый Массив;
	Пока ВыборкаКомиссия.НайтиСледующий(ВыборкаДокументов.ДокументСсылка, "ДокументСсылка") Цикл
		Если ВыборкаКомиссия.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель Тогда
			Описание.Вставить("ПредседательКомиссии", ВыборкаКомиссия.ЧленКомиссии);
			// ФИОПредседателяКомиссии
			Описание.Вставить("ФИОПредседателяКомиссии", "");
			Описание.Вставить("ПолПредседателяКомиссии", "");
			Описание.Вставить("ФамилияПредседателяКомиссии", "");
			КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ВыборкаКомиссия.ЧленКомиссии, "ФамилияИО, Пол, Фамилия", ОбщегоНазначения.ТекущаяДатаПользователя());
			Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
				Описание.Вставить("ФИОПредседателяКомиссии", СтрокаКадровыхДанных.ФамилияИО);
				Описание.Вставить("ПолПредседателяКомиссии", СтрокаКадровыхДанных.Пол);
				Описание.Вставить("ФамилияПредседателяКомиссии", СтрокаКадровыхДанных.Фамилия);
			КонецЦикла;
			Описание.Вставить("ДолжностьПредседателяКомиссии", ВыборкаКомиссия.ДолжностьЧленаКомиссии);
		Иначе
			КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ВыборкаКомиссия.ЧленКомиссии, "ФамилияИО, Пол, Фамилия", ОбщегоНазначения.ТекущаяДатаПользователя());
			Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
				МассивЧленовКомиссии.Добавить(Новый Структура("ЧленКомиссии, ФИОЧленКомиссии, ДолжностьЧленаКомиссии",
					ВыборкаКомиссия.ЧленКомиссии, СтрокаКадровыхДанных.ФамилияИО, ВыборкаКомиссия.ДолжностьЧленаКомиссии));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Описание.Вставить("ЧленыКомиссии", МассивЧленовКомиссии);
	
КонецПроцедуры

#КонецОбласти

Функция ОписаниеПодписейДокумента() Экспорт 
	
	ОписаниеПодписей = ПодписиДокументов.ОписаниеТаблицыПодписей();
	
	ПодписиДокументов.ДобавитьОписаниеПодписейОрганизации(ОписаниеПодписей, "Руководитель, ОтветственныйЗаОхрануТруда");
	
	Возврат ОписаниеПодписей;
		
КонецФункции

#КонецОбласти

#КонецЕсли
